# Manifest file for homebrew using the brew file addon.
#   Generate	brew bundle dump
#   Check		brew bundle check
#   Update		brew bundle install
#   Clean		brew bundle cleanup
# More output with --verbose option

# Brew extensions
tap "homebrew/bundle"           # brew files
tap "homebrew/cask"             # applications
tap "homebrew/cask-drivers"     # Garmin-Express
tap "homebrew/core"     
tap "hudochenkov/sshpass"       # Unoffical sshpass
tap "mongodb/brew"              # MongoDB

# Packages
brew "ansible"                  # Remote automation
brew "ansible-lint"             # Linter for Ansible
brew "awscli"                   # AWS command line
brew "bash-completion"          # CLI auto complete
brew "clang-format"             # Clang pretty printer
brew "cloud-nuke"               # Cloud resources cleanup
brew "cmake"                    # C++ build system
brew "exercism"                 # Coding puzzles
brew "fzf"                      # Fuzzy file finder
brew "git"                      # Git source control
brew "go"                       # Go programming language
brew "gpg"                      # GNO Pretty good privicy package
brew "graphviz"                 # Graph rendering for dot format
brew "hey"                      # HTTP load generator for server profiling
brew "htop"                     # CPU utilisation monitor
brew "httpie"                   # User friendly cURL replacement
brew "mas"                      # Brew Mac App Store integration
brew "mongodb-community-shell"  # MongoDB Shell
brew "node"                     # Node.js
brew "packer"                   # Amazon Machine Image builder
brew "protobuf"                 # Google Protocol buffer
brew "python"                   # Python programming language
brew "r"                        # R programming language
brew "redis"                    # Redis in memory data store
brew "ripgrep"                  # Faster grep
brew "sshpass"                  # Required for Ansible bootstrap of pico cluster
brew "terraform"                # Terraform infrastructure as code
brew "tmux"                     # Better terminal
brew "tree"                     # Directory listor

# Applications
cask "0xed"                     # Hex editor
cask "adobe-acrobat-reader"     # PDF reader
cask "adobe-creative-cloud"     # Adobe creative cloud
cask "anki"                     # Flashcards
cask "appcleaner"               # Application file cleanup
cask "balenaetcher"             # Card writer
cask "beyond-compare"           # File/Directory differ
cask "cpuinfo"                  # CPU usage monitor
cask "disk-drill"               # Deleted file recovery
cask "disk-inventory-x"         # Disk space utility
cask "docker"                   # Container engine
cask "dropbox"                  # Cloud file storage/syncing
cask "firefox"                  # Browser
cask "garmin-express"           # Garmin express
cask "geekbench"                # Performance benchmarking
cask "google-chrome"            # Browser
cask "google-earth-pro"         # Google earth
cask "iterm2"                   # Better terminal interface
cask "insomnia"                 # REST/HTTP & GraphQL client
cask "lastpass"                 # Password manager
cask "logitech-camera-settings" # Webcam settings
cask "macvim"                   # Vim for Mac
cask "mongodb-compass"          # GUI for MongoDB
cask "obs"                      # Screen capture
cask "opera"                    # Browser
cask "oversight"                # Webcam security
cask "parallels"                # Vitrual Machines
cask "rstudio"                  # R IDE
cask "sizeup"                   # Window management
cask "skype"                    # VOIP calling
cask "speedcrunch"              # Calculator
cask "sublime-text"             # Text editor
cask "synologyassistant"        # NAS management
cask "visual-studio-code"       # IDE
cask "vlc"                      # Video player
cask "wacom-tablet"             # Wacom tablet drivers
cask "whatsapp"                 # Whats App chat
cask "wireshark"                # Packet sniffer
cask "xmind"                    # Mind mapping

# Mac AppStore applications
mas "AdGuard for Safari", id: 1440147259        # Ad blocking
mas "BaseCamp", id: 411052274                   # Garmin Mapping
mas "CopyClip 2", id: 1020812363                # Clipboard manager
mas "Disk Speed Test", id: 425264550            # HD profiling
mas "iMovie", id: 408981434                     # Movie editing
mas "KakaoTalk", id: 869223134                  # KakaoTalk chat client
mas "Screeny", id: 440991524                    # Partial screen capture
mas "Streaks", id: 1493327990					# Habit tracking
mas "Slack", id: 803453959                      # Chat app
mas "Space Gremlin", id: 414515628              # HD space explorer
mas "WiFi Explorer", id: 494803304              # Wifi profiler
mas "Xcode", id: 497799835                      # IDE
