# File generated using 'brew bundle dump'
# Run using 'brew bundle install'

# Brew extensions
tap "homebrew/bundle"           # brew files
tap "homebrew/cask"             # applications
tap "homebrew/cask-drivers"     # Garmin-Express
tap "homebrew/core"     
tap "mongodb/brew"              # MongoDB

# Packages
brew "ansible"                  # Remote automation
brew "bash-completion"          # CLI auto complete
brew "clang-format"             # Clang pretty printer
brew "cmake"                    # C++ build system
brew "exercism"                 # Coding puzzles
brew "fzf"                      # Fuzzy file finder
brew "gpg"                      # GNO Pretty good privicy package
brew "git"                      # Git source control
brew "go"                       # Go programming language
brew "htop"                     # CPU utilisation monitor
brew "mas"                      # Brew Mac App Store integration
brew "mongodb-community"        # MongoDB database
brew "protobuf"                 # Google Protocol buffer
brew "python"                   # Python programming language
brew "r"                        # R programming language
brew "ripgrep"                  # Faster grep
brew "sshpass"                  # SSH scripting util
brew "tmux"                     # Better terminal
brew "tree"                     # Directory listor

# Applications
cask "0xed"                     # Hex editor
cask "adobe-acrobat-reader"     # PDF reader
cask "adobe-creative-cloud"     # Adobe creative cloud
cask "anki"                     # Flashcards
cask "appcleaner"               # Application file cleanup
cask "balenaetcher"             # Card writer
cask "beyond-compare"           # File/Directory differ
cask "docker"                   # Container engine
cask "dropbox"                  # Cloud file storage/syncing
cask "firefox"                  # Browser
cask "garmin-express"           # Garmin express
cask "google-chrome"            # Browser
cask "google-earth-pro"         # Google earth
cask "iterm2"                   # Better terminal interface
cask "lastpass"                 # Password manager
cask "macvim"                   # Vim for Mac
cask "obs"                      # Screen capture
cask "opera"                    # Browser
cask "p4v"                      # Perforce App
cask "perforce"                 # Perforce source control
cask "robo-3t"                  # MongoDB admin
cask "rstudio"                  # R IDE
cask "sizeup"                   # Window management
cask "skype"                    # VOIP calling
cask "speedcrunch"              # Calculator
cask "sublime-text"             # Text editor
cask "synologyassistant"        # NAS management
cask "visual-studio-code"       # IDE
cask "vlc"                      # Video player
cask "wacom-tablet"             # Wacom tablet drivers
cask "wireshark"                # Packet sniffer
cask "xmind"                    # Mind mapping

# Mac AppStore applications
mas "AdGuard for Safari", id: 1440147259        # Ad blocking
mas "BaseCamp", id: 411052274                   # Garmin Mapping
mas "CopyClip", id: 595191960                   # Clipboard history
mas "Disk Speed Test", id: 425264550            # HD profiling
mas "iMovie", id: 408981434                     # Movie editing
mas "Kindle", id: 405399194                     # Kindle reader
mas "Microsoft Remote Desktop", id: 1295203466  # Windows remote desktop
mas "Reeder", id: 880001334                     # RSS reader
mas "Screeny", id: 440991524                    # Partial screen capture
mas "Slack", id: 803453959                      # Chat app
mas "Space Gremlin", id: 414515628              # HD space explorer
mas "WiFi Explorer", id: 494803304              # Wifi profiler
mas "Xcode", id: 497799835                      # IDE
