# Manifest file for homebrew using the brew file addon.
#   Generate	brew bundle dump
#   Check		brew bundle check
#   Update		brew bundle install
#   Clean		brew bundle cleanup
# More output with --verbose option

# Brew extensions
tap "homebrew/bundle"           # brew files
tap "homebrew/cask"             # applications
tap "homebrew/cask-drivers"     # Garmin-Express
tap "homebrew/core"     
tap "hudochenkov/sshpass"       # Unoffical sshpass
tap "mongodb/brew"              # MongoDB

# Packages
brew "ansible"                  # Remote automation
brew "ansible-lint"             # Linter for Ansible
brew "bash-completion"          # CLI auto complete
brew "btop"                     # Terminal system monitor
brew "clang-format"             # Clang pretty printer
brew "cloc"             		# Count lines of code
brew "cmake"                    # C++ build system
brew "exercism"                 # Coding puzzles
brew "fzf"                      # Fuzzy file finder
brew "git"                      # Git source control
brew "go"                       # Go programming language
brew "gpg"                      # GNO Pretty good privicy package
brew "graphviz"                 # Graph rendering for dot format
brew "hey"                      # HTTP load generator for server profiling
brew "htop"                     # CPU utilisation monitor
brew "httpie"                   # User friendly cURL replacement
brew "k9s"                      # Kubernetes enhanced CLI 
brew "mas"                      # Brew Mac App Store integration
brew "mongodb-community-shell"  # MongoDB Shell
brew "ncdu"                     # Command line disk usage
brew "protobuf"                 # Google Protocol buffer
brew "python"                   # Python programming language
brew "ripgrep"                  # Faster grep
brew "sshpass"                  # Required for Ansible bootstrap of pico cluster
brew "tmux"                     # Better terminal
brew "tree"                     # Directory listor
brew "watch"                    # Watch command

# Applications
cask "adobe-acrobat-reader"     # PDF reader and form filling
cask "adobe-creative-cloud"     # Adobe creative cloud
cask "anki"                     # Flashcards
cask "appcleaner"               # Application file cleanup
cask "balenaetcher"             # Card writer
cask "beyond-compare"           # File/Directory differ
cask "docker"                   # Container engine
cask "dropbox"                  # Cloud file storage/syncing
cask "elgato-camera-hub"        # Facecam settings
cask "firefox"                  # Browser
cask "garmin-express"           # Garmin express
cask "geekbench"                # Performance benchmarking
cask "google-chrome"            # Browser
cask "google-earth-pro"         # Google earth
cask "insomnia"                 # REST/HTTP & GraphQL client
cask "iterm2"                   # Better terminal interface
cask "klogg"                    # Log viewer
cask "lastpass"                 # Password manager
cask "macvim"                   # Vim for Mac
cask "mongodb-compass"          # GUI for MongoDB
cask "obs"                      # Screen capture
cask "obsidian"                 # Note taking
cask "oversight"                # Webcam security
cask "parsec"                   # Desktop streaming for gaming
cask "quitter"                  # Auto exit select apps after time period
cask "rode-central"             # Microphone settings
cask "samsung-portable-ssd-t7"  # Samsung T7 app
cask "sizeup"                   # Window management
cask "skype"                    # VOIP calling
cask "sonos"                    # Sonos speaker control
cask "speedcrunch"              # Calculator
cask "stats"                    # System usage monitor
cask "visual-studio-code"       # IDE
cask "vlc"                      # Video player
cask "wacom-tablet"             # Wacom tablet drivers
cask "whatsapp"                 # Whats App chat
cask "wireshark"                # Packet sniffer
cask "xmind"                    # Mind mapping
cask "zoom"                     # Video calling
cask "zwift"                    # Cycling training

# Mac AppStore applications
mas "about-blank", id: 1239207203				# Site blocking safari extension
mas "AdGuard for Safari", id: 1440147259        # Ad blocking
mas "BaseCamp", id: 411052274                   # Garmin Mapping
mas "Be Focused Pro", id: 961632517             # Pomodoro timer
mas "Blackmagic Disk Speed Test", id: 425264550 # Disk speed testing
mas "CopyClip 2", id: 1020812363                # Clipboard manager
mas "Disk Speed Test", id: 425264550            # HD profiling
mas "Fit File Explorer", id: 1244431640         # Garmin fit file viewer
mas "iMovie", id: 408981434                     # Movie editing
mas "KakaoTalk", id: 869223134                  # KakaoTalk chat client
mas "Keynote", id: 409183694                    # Presentations
mas "Kindle", id: 405399194                     # Kindle reader
mas "Numbers", id: 409203825                    # Spreadsheets
mas "Pages", id: 409201541                      # Word processing
mas "Screeny", id: 440991524                    # Partial screen capture
mas "Slack", id: 803453959                      # Chat app
# mas "Streaks", id: 963034692                    # Habit tracking
mas "WiFi Explorer", id: 494803304              # Wifi profiler
mas "Xcode", id: 497799835                      # IDE
