<?xml version="1.0" encoding="utf-8"?>
<!-- Usage 'choco install Chocolatey.config -y' -->
<packages>
  <package id="7zip" />                         <!-- File compression utility -->
  <package id="agentransack" />                 <!-- File search console -->
  <package id="ConEmu" />                       <!-- Console manager -->
  <package id="curl" />                         <!-- CLI URL utility -->
  <package id="dependencywalker" />             <!-- DLL/EXE dependencies -->
  <package id="ditto" />                        <!-- Clipboard manager -->
  <package id="docker-desktop" />               <!-- Docker container engine -->
  <package id="Everything" />                   <!-- Better file searching -->
  <package id="Firefox" />                      <!-- Firefox web browser -->
  <package id="fzf" />                          <!-- Fuzzy file searching CLI -->
  <package id="git" />                          <!-- Git source control -->
  <package id="golang" />                       <!-- Go programming language -->
  <package id="graphviz.portable" />            <!-- Graphing tools -->
  <package id="greenshot" />                    <!-- Screenshot utility -->
  <package id="gsudo" />                        <!-- sudo for windows -->
  <package id="hxd" />                          <!-- Hex editor -->
  <package id="imageglass" />                   <!-- Image viewer -->
  <package id="insomnia-rest-api-client" />     <!-- REST API client -->
  <package id="microsoft-windows-terminal" />   <!-- Windows terminal client -->
  <package id="mongodb-compass" />              <!-- MongoDB GUI -->
  <package id="mongodb-shell" />                <!-- MongoDB CLI -->
  <package id="ntop.portable" />                <!-- htop clone -->
  <package id="opera" />                        <!-- Opera web browser -->
  <package id="p4" />                           <!-- Perforce source control CLI -->
  <package id="p4v" />                          <!-- Perforce source control UI -->
  <package id="paint.net" />                    <!-- Image editor -->
  <package id="processhacker" />                <!-- Task manager replacement -->
  <package id="procmon" />                      <!-- Process monitor -->
  <package id="python3" />                      <!-- Python scripting languard -->
  <package id="r" />                            <!-- R statistical programming lanuguage -->
  <package id="ripgrep" />                      <!-- Faster grep -->
  <package id="R.Studio" />                     <!-- R IDE -->
  <package id="slack" />                        <!-- Chat utility -->
  <package id="speedcrunch" />                  <!-- Calculator replacement -->
  <package id="sublimetext3" />                 <!-- Sublime text editor -->
  <package id="sysinternals" />                 <!-- Microsoft utility collection -->
  <package id="vim" />                          <!-- Vim text editor -->
  <package id="vlc" />                          <!-- Video viewer -->
  <package id="vscode" />                       <!-- VS Code IDE -->
  <package id="windbg" />                       <!-- Debugger -->
  <package id="windirstat" />                   <!-- Hard drive space explorer -->
  <package id="windows-performance-toolkit" />  <!-- Windows Performance Analyzer -->
  <package id="wireshark" />                    <!-- Network packet sniffer -->
</packages>
